# BuiltInFailures.SpanDirectionSymbolFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SpanDirectionSymbolFailures Class
BuiltInFailures Class Members See Also
---
Failures about SpanDirectionSymbol.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SpanDirectionSymbolFailures
```

Visual Basic
---
```text
Public NotInheritable Class SpanDirectionSymbolFailures
```

Visual C++
---
```text
public ref class SpanDirectionSymbolFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SpanDirectionSymbolFailures
# See Also
BuiltInFailures..::..SpanDirectionSymbolFailures Members
Autodesk.Revit.DB Namespace